{"meta":{"title":"WuDi's Blog","subtitle":"","description":"Keep Moving","author":"WuDi","url":"http://awesomecoder.top","root":"/"},"pages":[{"title":"About me","date":"2021-05-07T08:16:23.000Z","updated":"2021-05-07T11:39:24.866Z","comments":true,"path":"about/me.html","permalink":"http://awesomecoder.top/about/me.html","excerpt":"","text":"首先呢，这里是Wu Di的个人博客，能看到这儿想必我们一定是有特别的缘分吧哈哈。大家都知道，编程真的是一门永远也学不完的课，你只能keep moving！！！因此，今后我将在这里记录自己在编程路上遇到的坑以及点亮的技能树。"},{"title":"categories","date":"2021-05-07T11:57:01.000Z","updated":"2021-05-07T11:58:33.365Z","comments":true,"path":"categories/index.html","permalink":"http://awesomecoder.top/categories/index.html","excerpt":"","text":""},{"title":"RESEARCH","date":"2021-05-07T12:52:06.000Z","updated":"2021-06-28T03:37:02.801Z","comments":true,"path":"research/research.html","permalink":"http://awesomecoder.top/research/research.html","excerpt":"","text":"Publications◎ Wu Di, Li H, Liu X, et al. Design of Gesture Recognition System Based on Multi-Channel Myoelectricity Correlation[C] 2019 IEEE Global Communications Conference (GLOBECOM 2019). IEEE, 2019: 1-6. ◎ Di Wu. “ ApneaYOLO: Respiratory Signal Driven Sleep Apnea Events Detection and Localization Model.” Journal of Biomedical and Health Informatics (JBHI 2021). ◎ Haoran Xu, Ke Lan and Di Wu. “A Semi-Supervised Machine Learning Method for Electrocardiogram and Respiratory Signal Quality Assessment of a Wearable Device: Design, Validation and Its Application.” JMIR mHealth and uHealth (JMU 2021, Q2/IF=4.312). ◎ Huiyong Li, Di Wu, Jianwei Niu, Fei Gu. “一种基于多通道肌电信号相关性的手势识别方法.” Patent, [P:CN110399846A], China. Challenges◎ None ◎ None Academic Activities◎ Reviewers of Journals: ✤Journal of Biomedical and Health Informatics (JBHI) ✤JMIR mHealth and uHealth (JMU) ◎ Reviewers of Conferences: ✤IEEE Global Communications Conference (GLOBECOM 2019)"},{"title":"Personal Resume","date":"2021-05-07T12:27:49.000Z","updated":"2021-07-18T16:12:35.363Z","comments":true,"path":"resume/resume.html","permalink":"http://awesomecoder.top/resume/resume.html","excerpt":"","text":"EducationPhD of Electronic Information Engineering, Beihang University(BUAA), Beijing, 2021-now Master of Aerospace Engineering, Beihang University(BUAA), Beijing, 2017-2020 National scholarship for graduate students Bachelor of Information and Computing Science, Taiyuan University of Technology, Taiyuan, 2013-2017 Research and Industry Experience*Analysis of biomedical signal and electronic medical records, Algorithm Engineer, Chinese PLA General Hospital Research Center of Medical Artificial Intelligence, Beijing, 2020.3-2021.8* Responsible for the analysis and processing of multi-modal biomedical signals including basic feature extraction, motion artifact interference processing, signal filtering and depth analysis Developing techniques of deep learning for precise medical treatment *Multi-partition real time micro kernel operating system, Internship, ACINFO Corporation, Beijing, 2018.7-2018.11* Engaged in developing some modules of a real time os SylixOS, including partition module, memory management module, interrupt &amp; request module and microkernel thread module Developing techniques of deep learning for real-time detection of pedestrians and vehicles in traffic scenes with complex backgrounds Adopting Super resolution, which adds additional prior knowledge for tiny objects, to tackle with the poor detection accuracy and insufficient high frequency information of small objects Artificial intelligence subsystem in mobile games, Senior Software Development Engineer, Netease Games, Hangzhou, 2015.7-2016.7 Developed AI framework via technique of Finite State Machine (FSM) and Behavior Tree (BT) for monsters and bosses in mobile game Completed auto battle system to help characters to continue fighting even the player is offline Developed ancient god card subsystem which is responsible for skill selections [Student] Transaction Agent System, Test Engineer, BUAA-Lab of Distributed and Mobile Computing, Beijing, 2017.7-2020.1 Developed an automatic test framework of Transaction Agent System to ensure new code in development does not bring bugs to the previous system [Internship] Transaction Agent System, Test Engineer, 微小卫星实验室, Beijing, 2017.7-2020.1 Developed an automatic test framework of Transaction Agent System to ensure new code in development does not bring bugs to the previous system Technology Applications and Expertise Specialized Skills deep learning, machine learning, biomedical signal analysis, analysis of electronic medical records person re-identification Markup/Programming/framework Python, C/C++, PyTorch"},{"title":"tags","date":"2021-05-07T11:56:44.000Z","updated":"2021-05-07T11:58:58.004Z","comments":true,"path":"tags/index.html","permalink":"http://awesomecoder.top/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Linux必知必会","slug":"pytorch/Linux必知必会","date":"2021-12-14T16:00:00.000Z","updated":"2022-02-17T07:25:33.826Z","comments":true,"path":"2021/12/15/pytorch/Linux必知必会/","link":"","permalink":"http://awesomecoder.top/2021/12/15/pytorch/Linux%E5%BF%85%E7%9F%A5%E5%BF%85%E4%BC%9A/","excerpt":"Linux使用教程","text":"Linux使用教程 常用文件管理命令tmux 和 vimshell 语法sshgitthrift管道、环境变量与常用命令租云服务器及配置docker环境 $\\Phi = \\sum_a^bx_i$","categories":[{"name":"教程","slug":"教程","permalink":"http://awesomecoder.top/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"Linux","slug":"Linux","permalink":"http://awesomecoder.top/tags/Linux/"}]},{"title":"pyTorch获取中间层输出的几种方法","slug":"pytorch/Pytorch获取中间层输出的几种方法","date":"2021-07-17T16:00:00.000Z","updated":"2021-07-18T14:59:28.184Z","comments":true,"path":"2021/07/18/pytorch/Pytorch获取中间层输出的几种方法/","link":"","permalink":"http://awesomecoder.top/2021/07/18/pytorch/Pytorch%E8%8E%B7%E5%8F%96%E4%B8%AD%E9%97%B4%E5%B1%82%E8%BE%93%E5%87%BA%E7%9A%84%E5%87%A0%E7%A7%8D%E6%96%B9%E6%B3%95/","excerpt":"总结了3种输出网络中间层的方法","text":"总结了3种输出网络中间层的方法 方法11234567891011121314151617import torchimport torch.nn as nnmodel = nn.Sequential( nn.Conv2d(3, 9, 1, 1, 0, bias=False), nn.BatchNorm2d(9), nn.ReLU(inplace=True), nn.AdaptiveAvgPool2d((1, 1)), )# 假如想要获得ReLu的输出x = torch.rand([2, 3, 224, 224])for i in range(len(model)): x = model[i](x) if i == 2: ReLu_out = xprint(&#x27;ReLu_out.shape：\\n\\t&#x27;,ReLu_out.shape)print(&#x27;x.shape：\\n\\t&#x27;,x.shape) 方法2123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657from collections import OrderedDict import torchfrom torch import nn class IntermediateLayerGetter(nn.ModuleDict): &quot;&quot;&quot; Module wrapper that returns intermediate layers from a model It has a strong assumption that the modules have been registered into the model in the same order as they are used. This means that one should **not** reuse the same nn.Module twice in the forward if you want this to work. Additionally, it is only able to query submodules that are directly assigned to the model. So if `model` is passed, `model.feature1` can be returned, but not `model.feature1.layer2`. Arguments: model (nn.Module): model on which we will extract the features return_layers (Dict[name, new_name]): a dict containing the names of the modules for which the activations will be returned as the key of the dict, and the value of the dict is the name of the returned activation (which the user can specify). &quot;&quot;&quot; def __init__(self, model, return_layers): if not set(return_layers).issubset([name for name, _ in model.named_children()]): raise ValueError(&quot;return_layers are not present in model&quot;) orig_return_layers = return_layers return_layers = &#123;k: v for k, v in return_layers.items()&#125; layers = OrderedDict() for name, module in model.named_children(): layers[name] = module if name in return_layers: del return_layers[name] if not return_layers: break super(IntermediateLayerGetter, self).__init__(layers) self.return_layers = orig_return_layers def forward(self, x): out = OrderedDict() for name, module in self.named_children(): x = module(x) if name in self.return_layers: out_name = self.return_layers[name] out[out_name] = x return out# examplem = torchvision.models.resnet18(pretrained=True)# extract layer1 and layer3, giving as names `feat1` and feat2`new_m = torchvision.models._utils.IntermediateLayerGetter(m,&#123;&#x27;layer1&#x27;: &#x27;feat1&#x27;, &#x27;layer3&#x27;: &#x27;feat2&#x27;&#125;)out = new_m(torch.rand(1, 3, 224, 224))print([(k, v.shape) for k, v in out.items()])# [(&#x27;feat1&#x27;, torch.Size([1, 64, 56, 56])), (&#x27;feat2&#x27;, torch.Size([1, 256, 14, 14]))] 方法3：hook123456789101112131415161718192021222324252627282930313233343536373839404142434445464748class TestForHook(nn.Module): def __init__(self): super().__init__() self.linear_1 = nn.Linear(in_features=2, out_features=2) self.linear_2 = nn.Linear(in_features=2, out_features=1) self.relu = nn.ReLU() self.relu6 = nn.ReLU6() self.initialize() def forward(self, x): linear_1 = self.linear_1(x) linear_2 = self.linear_2(linear_1) relu = self.relu(linear_2) relu_6 = self.relu6(relu) layers_in = (x, linear_1, linear_2) layers_out = (linear_1, linear_2, relu) return relu_6, layers_in, layers_outfeatures_in_hook = []features_out_hook = []def hook(module, fea_in, fea_out): features_in_hook.append(fea_in) features_out_hook.append(fea_out) return Nonenet = TestForHook()&quot;&quot;&quot;# 第一种写法，按照类型勾，但如果有重复类型的layer比较复杂net_chilren = net.children()for child in net_chilren: if not isinstance(child, nn.ReLU6): child.register_forward_hook(hook=hook)&quot;&quot;&quot;&quot;&quot;&quot;推荐下面我改的这种写法，因为我自己的网络中，在Sequential中有很多层，这种方式可以直接先print(net)一下，找出自己所需要那个layer的名称，按名称勾出来&quot;&quot;&quot;layer_name = &#x27;relu_6&#x27;for (name, module) in net.named_modules(): if name == layer_name: module.register_forward_hook(hook=hook)print(features_in_hook) # 勾的是指定层的输入print(features_out_hook) # 勾的是指定层的输出","categories":[{"name":"教程","slug":"教程","permalink":"http://awesomecoder.top/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"pyTorch","slug":"pyTorch","permalink":"http://awesomecoder.top/tags/pyTorch/"}]},{"title":"English Interview","slug":"经验总结/english-interview","date":"2021-04-30T12:00:00.000Z","updated":"2021-07-18T14:57:56.531Z","comments":true,"path":"2021/04/30/经验总结/english-interview/","link":"","permalink":"http://awesomecoder.top/2021/04/30/%E7%BB%8F%E9%AA%8C%E6%80%BB%E7%BB%93/english-interview/","excerpt":"Introduce yourselfRespected professors, Good morning/afternoon: My name is Wu Di. It is really a great honor to have this opportunity for a interview, I would like to answer whatever you may raise, and I hope I can make a good performance today.","text":"Introduce yourselfRespected professors, Good morning/afternoon: My name is Wu Di. It is really a great honor to have this opportunity for a interview, I would like to answer whatever you may raise, and I hope I can make a good performance today. Now I will introduce myself briefly, I am 26 years old, born in Shangqiu, Henan province. I have graduated from Beihang University at 2020, my major is Aerospace Engineering. In the past 3 years, I spent most of my time on studying. I have published three academic papers and one patent which are deep learning related. Besides, I have also taken a tour to some big factories and companies when I was a master student. So I have acquired basic knowledge of deep learning in both theory and practice. And I currently working at Chinese PLA General Hospital as an algorithm engineer, where I mainly focus on how to use deep learning methods for precise medical treatment which is convenient to doctors and patients. During my job, I engaged in developing deep learning methods and responsible for the analysing of continuous biomedical signal including ECG, respiration signal, blood pressure, pluse and three-axis acceleration etc. For example, I proposed an algorithm based on YOLO which is a famous object detection method to localize the sleep apnea events during sleep. The main character of our method is, it is a 1 dimension signal suitable neural network which can predict not only where these events happened but also get the confidence of how possible they would happen. Besides, my research area also include hand-gesture recognize based on EMG, signal quality assessment based on unsupervised learning and analysis of electronic medical records. Thank you! What is your greatest strength?I feel that my strongest asset is my ability to stick to things to get them done. I feel a real sense of accomplishment when I finish a thing and it turns out just as I’d planned. I’ve set some high goals for myself. For example, I want to graduate with highest distinction. And even though I had a slow start in my freshman year, I made up for it by doing an honor’s thesis. What is your greatest weakness?I am a perfectionist and I pay very much attention to details. Sometimes I am quite captious. xx How do you feel about your progress to date?Honestly speaking I am quite content with my progress in my university studies. As a freshman in deep learning, I have accumulated considerable professional knowledge for prospective application. Besides, I made use of the extra curricular life in the university to do some meaningful things such as traveling, participating in academic forum, applying for internship in related studios as well as reading classic guides of designing, which not only broadened my horizon but also made me have a better understanding of what I have learned. I have become a student who gets more interested in what he majors in and knows what to do to improve himself. Satisfiedas I am in terms of my previous improvement, I do have to admit that there are much I can do in the future. First of all, I am not familiar with the whole designing procedure of constructing a new building, which is crucial for aqualified architect. Moreover, I should improve my sketching skills to make sure that my ideas can be understood correctly. Thirdly, learning more architecture styles is also of vital importance because only by acquiring more styles can I find mine in the future. Furthermore, improving the understanding of interior designing can help me with comprehending the relationship between interior decoration and exterior design. Knowing what I have done and how Ishould do to improve myself give me the confidence to dig in my major, I believe that I will gain satisfactory achievements in the future. What has been your greatest accomplishment? My greatest accomplishment is that I was enrolled by China Agricultural University in 2009. Tell me about your family. There are three people in my family. My parents are workers, though they have not recived college education, their honest and candid impress me a lot. What have you learned from the jobs you have held?I learned how to cooperate and exchange from my work, and I have improved the collective sense of honor. Tell me about a time when your course load was heaviest. How did you get all of your work done? I will make a good study plan. Divide time into several time periods each day, and I will do different jobs at different times. Tell me about a time when you were creative in solving a problem.First of all, I will understand the cause of the problem. Then I will summarize the methods and experience to solve this kind of problem. On the basis of this, I try to propose new solutions. xx Describe your experimental skills. During the past three years, under the strict guidance of my supervisor, I have learned systematically the theory of profession and got the basic manipulative skills about the analysis of veterinary drugs. I have successfully finished the subject “Pharmacokinetics and pharmadynamics study of compound amoxicillin intramammary infusion in lactating cows after repeated administrations”and grasped some experimental skills, such as sample extraction, sample clean-up, instrument operation. What’s your hobby? In my spare time, I like reading and travel. Reading makes me intelligent and travel broaden my horizens. Why do you choose our faculty as your major?I chose Prof Li Deyu have three reasons. First, he has a profound academic standards and he is responsive. Second, There is a high level of professional construction, especially, the biomedical engineer is ranked in the first few in the country. Third, I am also graduated from Beihang University and I am familiar with our school, so I plan to study here in the future. xxHow will you plan to devote to your potential programme?PhD degree is not a ticket that youjust do. A PhD is training on how to think, how to learn, and how to doresearch of sufficient quality that it contributes to the field that the PhD isin. I must think and plan everything efficiently and earlier. Problem solving skill/time management. During myMsc degree, besides compulsory modules which were already about the current hot topics, I have been to several seminars which interested me. There were so many seminars relatedto malaria, such as Gene drive for population suppression of the malaria mosquito Investigating signalling molecules essential formalaria parasite infection and transmission Why phd?There are several reasons accounting for my endeavor. Above all, I have been deeply impressed by the academic atmosphere. I feel so satisfied and pleasure after I finish my project write-up. I want to publish papers to prove myself. I enjoy the life as a researcher. Secondly, though I learnt a lot from my master study during the past 3 years. However, I think further study is still urgent for me to realize self-value. Life is precious. It is necessary to seize any chance for self-development, especially in this competitive modern world. In a word, I am looking forward to making a solid foundation for future profession after several years study here.","categories":[{"name":"干货","slug":"干货","permalink":"http://awesomecoder.top/categories/%E5%B9%B2%E8%B4%A7/"}],"tags":[{"name":"Interview","slug":"Interview","permalink":"http://awesomecoder.top/tags/Interview/"}]},{"title":"Neovim + Ubuntu快速搭建教程","slug":"经验总结/nvim_linux","date":"2021-04-30T12:00:00.000Z","updated":"2021-07-18T14:55:04.813Z","comments":true,"path":"2021/04/30/经验总结/nvim_linux/","link":"","permalink":"http://awesomecoder.top/2021/04/30/%E7%BB%8F%E9%AA%8C%E6%80%BB%E7%BB%93/nvim_linux/","excerpt":"Neovim + Ubuntu快速搭建教程先说下目的吧，因为自己经常需要在GPU服务器上跑DL模型，大多数时候是通过本地debug之后的代码上传到服务器来跑。这样最大的问题就是效率太低，每次出错都要把代码拉下来修改。其次呢，因为是通过终端来操作大部分使用的是vim编辑器。说实话，写了这么多年的代码了vim用的是相当的不熟练。所以想学一学vim并且想要找到一个好的插件，能够满足我的一下需求： 方便文件的操作（增删改查） 支持python自动补全 可以debug 以上操作均是通过终端实现 正好在b站看到大佬TheCW出得Neovim教程发现vim效率确实高，于是花了几天自己动手搭建了一次。中间多多少少遇到了一点坑，总结一下为了以后配置更快点吧。","text":"Neovim + Ubuntu快速搭建教程先说下目的吧，因为自己经常需要在GPU服务器上跑DL模型，大多数时候是通过本地debug之后的代码上传到服务器来跑。这样最大的问题就是效率太低，每次出错都要把代码拉下来修改。其次呢，因为是通过终端来操作大部分使用的是vim编辑器。说实话，写了这么多年的代码了vim用的是相当的不熟练。所以想学一学vim并且想要找到一个好的插件，能够满足我的一下需求： 方便文件的操作（增删改查） 支持python自动补全 可以debug 以上操作均是通过终端实现 正好在b站看到大佬TheCW出得Neovim教程发现vim效率确实高，于是花了几天自己动手搭建了一次。中间多多少少遇到了一点坑，总结一下为了以后配置更快点吧。 Installation Ubuntu 18.04 LST Neovim 0.5.0+ 安装Neovim这里遇到了一点坑，就是一开始使用命令 1sudo apt-get install neovim 无奈可能是apt版本太低，导致安装的Neovim版本为0.2.x。GooGle到一篇文章推荐使用ppa安装，命令如下： 123sudo add-apt-repository ppa:neovim-ppa/unstablesudo apt updatesudo apt install -y neovim 第一行指定为unstable可下载最新的版本. 安装Nodejs这里是踩的第二个坑，由于需要配置许多插件，其中coc.nvim在启动nvim时老弹出错误，搞了半天才发现是Nodejs版本太低。需要12.12.x以上，但是我这台服务器已经装了6.x的版本，一开始在配环境变量上耽误了许多时间，但还是没搞定。最后采用了另外一种方法，通过nvm安装。这里介绍一下，nvm是针对nodejs的专门软件，可以很方便的安装卸载各个版本。这里的命令如下： 1wget -qO- https://raw.githubusercontent.com/nvm-sh/nvm/v0.38.0/install.sh | bash 其中 v0.38.0为nvm的版本，可通过这里查看Lastest nvm version 安装好nvm之后可安装nodejs了，这里安装的版本为v14.17.3 12nvm install &lt;version-number&gt;nvm use &lt;version-number&gt; 下载vim-plug插件github 自己搜吧 设置nvim的配置文件+插件与vim不同的是，nvim的配置文件在～/.config/nvim/init.vim，vim在～/.vim/.vimrc首先，进入.config文件夹并clone我放在GitHub上的配置文件 1234cd ~/.config/git clone https://github.com/wudi1183456665/nvim.gitcd nvimmkdir plugged tmp 启动nvim及安装插件首次启动时可通过终端输入nvim启动，强迫症的我习惯了之前的vim启动，这里可以修改zsh的启动文件打开vim ~/.zshrc 添加alias vim=’nvim’ 插件的安装也很容易，主要就是网速太慢进入nvim，输入:PlugInstall 应该会自动安装，安装完成后就可以愉快的使用了。","categories":[{"name":"干货","slug":"干货","permalink":"http://awesomecoder.top/categories/%E5%B9%B2%E8%B4%A7/"}],"tags":[{"name":"Linux","slug":"Linux","permalink":"http://awesomecoder.top/tags/Linux/"},{"name":"Nvim","slug":"Nvim","permalink":"http://awesomecoder.top/tags/Nvim/"}]}],"categories":[{"name":"教程","slug":"教程","permalink":"http://awesomecoder.top/categories/%E6%95%99%E7%A8%8B/"},{"name":"干货","slug":"干货","permalink":"http://awesomecoder.top/categories/%E5%B9%B2%E8%B4%A7/"}],"tags":[{"name":"Linux","slug":"Linux","permalink":"http://awesomecoder.top/tags/Linux/"},{"name":"pyTorch","slug":"pyTorch","permalink":"http://awesomecoder.top/tags/pyTorch/"},{"name":"Interview","slug":"Interview","permalink":"http://awesomecoder.top/tags/Interview/"},{"name":"Nvim","slug":"Nvim","permalink":"http://awesomecoder.top/tags/Nvim/"}]}