{"meta":{"title":"WuDi's Blog","subtitle":"","description":"Keep Moving","author":"WuDi","url":"https://wudi1183456665.github.io/wudi.github.io","root":"/wudi.github.io/"},"pages":[{"title":"About me","date":"2021-05-07T08:16:23.000Z","updated":"2021-05-07T11:39:24.866Z","comments":true,"path":"about/me.html","permalink":"https://wudi1183456665.github.io/wudi.github.io/about/me.html","excerpt":"","text":"首先呢，这里是Wu Di的个人博客，能看到这儿想必我们一定是有特别的缘分吧哈哈。大家都知道，编程真的是一门永远也学不完的课，你只能keep moving！！！因此，今后我将在这里记录自己在编程路上遇到的坑以及点亮的技能树。"},{"title":"categories","date":"2021-05-07T11:57:01.000Z","updated":"2021-05-07T11:58:33.365Z","comments":true,"path":"categories/index.html","permalink":"https://wudi1183456665.github.io/wudi.github.io/categories/index.html","excerpt":"","text":""},{"title":"RESEARCH","date":"2021-05-07T12:52:06.000Z","updated":"2021-05-07T13:14:35.652Z","comments":true,"path":"research/research.html","permalink":"https://wudi1183456665.github.io/wudi.github.io/research/research.html","excerpt":"","text":"PublicationsPeer-reviewed Conferences◎ Guodong Zeng, and Guoyan Zheng. “3D Tiled Convolution for Effective Segmentation of Volumetric Medical Images.” International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI 2019). [Early Accept] ◎ Guodong Zeng, and Guoyan Zheng. “Hybrid Generative Adversarial Networks for Deep MR to CT Synthesis using Unpaired Data.” International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI 2019). ◎ Zenglin Shi, Guodong Zeng, Le Zhang, Xiahai Zhuang, Lei Li, Guang Yang, and Guoyan Zheng. “Bayesian voxdrn: A probabilistic deep voxelwise dilated residual network for whole heart segmentation from 3d mr images.” International Conference on Medical Image Computing and Computer-Assisted Intervention ( MICCAI 2018 ), pp. 569-577, Springer. [Sportlight] ◎ Guodong Zeng, and Guoyan Zheng. “Multi-scale fully convolutional DenseNets for automated skin lesion segmentation in dermoscopy images.” In International Conference Image Analysis and Recognition ( ICIAR 2018 ), pp. 513-521, Springer. [Best Paper Award] ◎ Guodong Zeng, and Guoyan Zheng. “Multi-stream 3D FCN with multi-scale deep supervision for multi-modality isointense infant brain MR image segmentation.” In 2018 IEEE 15th International Symposium on Biomedical Imaging (ISBI 2018), pp. 136-140. ◎ Rens Janssens, Guodong Zeng, and Guoyan Zheng. “Fully automatic segmentation of lumbar vertebrae from CT images using cascaded 3D fully convolutional networks.” In 2018 IEEE 15th International Symposium on Biomedical Imaging (ISBI 2018), pp. 893-897. ◎ Guodong Zeng, Hai-Miao Hu, Yanhing Geng, and Chi Zhang. “A person re-identification algorithm based on color topology.” In 2014 IEEE International Conference on Image Processing (ICIP 2014), pp. 2447-2451. IEEE, 2014. Peer-reviewed Journals◎ Guodong Zeng, and Guoyan Zheng. “Holistic Decomposition Convolution for Effective Semantic Segmentation of Medical Volume Images.” Medical image analysis (MIA 2019). ◎ Hossein Arabi, Guodong Zeng, Guoyan Zheng, and Habib Zaidi. “Novel adversarial semantic structure deep learning for MRI-guided attenuation correction in brain PET/MRI.” European journal of nuclear medicine and molecular imaging (EJNMMI 2019): 1-14. ◎ Florian Schmaranzer, Ronja Helfenstein, Guodong Zeng, Till D. Lerch, Eduardo N. Novais, James D. Wylie, Young-Jo Kim, Klaus A. Siebenrock, Moritz Tannast, and Guoyan Zheng. “Automatic MRI-based Three-dimensional Models of Hip Cartilage Provide Improved Morphologic and Biochemical Analysis.” Clinical Orthopaedics and Related Research 477, no. 5 (CORR 2019): 1036-1052. ◎ Li Wang, Dong Nie, Guannan Li, Élodie Puybareau, Jose Dolz, Qian Zhang, Fan Wang, Jing Xia, Zhengwang Wu, Jiawei Chen, Kim-Han Thung, Toan Duc Bui, Jitae Shin, Guodong Zeng, Guoyan Zheng, Vladimir S Fonov, Andrew Doyle, Yongchao Xu, Pim Moeskops, Josien PW Pluim, Christian Desrosiers, Ismail Ben Ayed, Gerard Sanroma, Oualid M Benkarim, Adrià Casamitjana, Verónica Vilaplana, Weili Lin, Gang Li, Dinggang Shen. “Benchmark on automatic 6-month-old infant brain segmentation algorithms: the iSeg-2017 challenge.” IEEE transactions on medical imaging (TMI 2019). ◎ Hugo J Kuijf, J Matthijs Biesbroek, Jeroen de Bresser, Rutger Heinen, Simon Andermatt, Mariana Bento, Matt Berseth, Mikhail Belyaev, M Jorge Cardoso, Adrià Casamitjana, D Louis Collins, Mahsa Dadar, Achilleas Georgiou, Mohsen Ghafoorian, Dakai Jin, April Khademi, Jesse Knight, Hongwei Li, Xavier Lladó, Miguel Luna, Qaiser Mahmood, Richard McKinley, Alireza Mehrtash, Sébastien Ourselin, Bo-yong Park, Hyunjin Park, Sang Hyun Park, Simon Pezold, Elodie Puybareau, Leticia Rittner, Carole H Sudre, Sergi Valverde, Verónica Vilaplana, Roland Wiest, Yongchao Xu, Ziyue Xu, Guodong Zeng, Jianguo Zhang, Guoyan Zheng, Christopher Chen, Wiesje van der Flier, Frederik Barkhof, Max A Viergever, Geert Jan Biessels. “Standardized assessment of automatic segmentation of white matter hyperintensities; results of the wmh segmentation challenge.” IEEE transactions on medical imaging (TMI 2019). ◎ Guodong Zeng, and Guoyan Zheng. “Deep Learning-Based Automatic Segmentation of the Proximal Femur from MR Images.” Advances in Experimental Medicine and Biology (Adv Exp Med Biol 2018), Intelligent Orthopaedics, pp. 73-79. Springer, Singapore, 2018. ◎ Haimiao Hu, Wen Fang, Guodong Zeng, Zihao Hu, and Bo Li. “A person re-identification algorithm based on pyramid color topology feature.” Multimedia Tools and Applications 76, no. 24 ( MTAP 2017): 26633-26646. Peer-reviewed Workshop, Abstract◎ Hossein Arabi, Guodong Zeng, Guoyan Zheng, and Habib Zaidi. “Does deep learning approaches outperform atlas-guided attenuation correction in brain PET/MRI?.” Journal of Nuclear Medicine 60, no. supplement 1 (2019): 175-175. ◎ Guodong Zeng, Qian Wang, Till Lerch, Florian Schmaranzer, Moritz Tannast, Klaus Siebenrock, and Guoyan Zheng. “Latent3DU-net: Multi-level latent shape space constrained 3D U-net for automatic segmentation of the proximal femur from radial MRI of the hip.” In International Workshop on Machine Learning in Medical Imaging (MLMI@MICCAI 2018), pp. 188-196. Springer, Cham, 2018. ◎ Guodong Zeng, Daniel Belavy, Shuo Li, and Guoyan Zheng. “Evaluation and Comparison of Automatic Intervertebral Disc Localization and Segmentation methods with 3D Multi-modality MR Images: A Grand Challenge.” In International Workshop and Challenge on Computational Methods and Clinical Applications for Spine Imaging (CSI@MICCAI 2018), pp. 163-171. Springer, Cham, 2018. ◎ Guodong Zeng, and Guoyan Zheng. “Deep Volumetric Shape Learning for Semantic Segmentation of the Hip Joint from 3D MR Images.” In International Workshop on Computational Methods and Clinical Applications in Musculoskeletal Imaging (MSKI@MICCAI 2018), pp. 35-48. Springer, Cham, 2018. ◎ Schmaranzer, F., R. Helfenstein, G. Zeng, T. D. Lerch, K. Siebenrock, M. Tannast, and G. Zheng. “Automatic MRI-based 3D Models of Hip Cartilage Using a 3D U-net-like Fully Convolutional Network for Improved Morphologic and Biochemical Analysis.” In Seminars in Musculoskeletal Radiology (Vol. 23, No. S 02, p. A021). Georg Thieme Verlag KG. ◎ Guodong Zeng, Xin Yang, Jing Li, Lequan Yu, Pheng-Ann Heng, and Guoyan Zheng. “3D U-net with multi-level deep supervision: fully automatic segmentation of proximal femur in 3D MR images.” In International workshop on machine learning in medical imaging (MLMI@MICCAI 2017), pp. 274-282. Springer, Cham, 2017. [Best Paper Award ] ◎ Guodong Zeng, and Guoyan Zheng. “DSMS-FCN: a deeply supervised multi-scale fully convolutional network for automatic segmentation of intervertebral disc in 3D MR images.” In International Workshop and Challenge on Computational Methods and Clinical Applications in Musculoskeletal Imaging (MSKI@MICCAI 2017), pp. 148-159. Springer, Cham, 2017. Patents◎ Haimiao Hu, Guodong Zeng, Yanbing Geng, Bo Li. “Person Retrieval Algorithm Based on Color Spatial Topology in Video Surveillance.” Patent, [P:201410344623.0], China. Challenges◎ We achieved the 3rd place out of 21 teams in the MICCAI Grand Challenge of iSeg-2017: 6-month Infant Brain MRI Segmentation Challenge. ◎ We achieved the 1st place in the MICCAI Grand Challenge of MM-WHS 2017: Multi-Modality Whole Heart Segmentation. Academic Activities◎ Reviewers of Journals: ✤Transactions on Biomedical Engineering (TBME) ✤Journal of Biomedical and Health Informatics (JBHI) ✤International Journal of Computer Assisted Radiology and Surgery (IJCARS) ✤Neurocomputing ◎ Reviewers of Conferences: ✤International Conference On Medical Image Computing &amp; Computer Assisted Intervention (MICCAI 2019) ✤International Society for Computer Assisted Orthopaedic Surgery Conference (CAOS 2019)"},{"title":"tags","date":"2021-05-07T11:56:44.000Z","updated":"2021-05-07T11:58:58.004Z","comments":true,"path":"tags/index.html","permalink":"https://wudi1183456665.github.io/wudi.github.io/tags/index.html","excerpt":"","text":""},{"title":"DI WU","date":"2021-05-07T12:27:49.000Z","updated":"2021-05-07T13:33:02.508Z","comments":true,"path":"resume/resume.html","permalink":"https://wudi1183456665.github.io/wudi.github.io/resume/resume.html","excerpt":"","text":"EducationMaster of Aerospace Engineering, Beihang University(BUAA), Beijing, 2017-2020 National scholarship for graduate students Bachelor of Information and Computing Science, Taiyuan University of Technology, Taiyuan, 2013-2017 Research and Industry Experience*Object detection and scene understanding for autonomous driving, Research Associate, ST Engineering-NTU Corporate Laborator, Singapore, 2016.7-2017.4* Developing techniques of deep learning for real-time detection of pedestrians and vehicles in traffic scenes with complex backgrounds Adopting Super resolution, which adds additional prior knowledge for tiny objects, to tackle with the poor detection accuracy and insufficient high frequency information of small objects *Artificial intelligence subsystem in mobile games, Senior Software Development Engineer, Netease Games, Hangzhou, 2015.7-2016.7* Developed AI framework via technique of Finite State Machine (FSM) and Behavior Tree (BT) for monsters and bosses in mobile game Completed auto battle system to help characters to continue fighting even the player is offline Developed ancient god card subsystem which is responsible for skill selections **[Internship] Chitu Advertisement System, Test Engineer, Tencent Corporation, Beijing, 2013.3-2013.8** Built an automatic test system to ensure the correct fund calculation of Chitu Advertisement System **[Internship] Transaction Agent System, Test Engineer, China Asset Management Co.,Ltd., Beijing, 2012.7-2013.1** Developed an automatic test framework of Transaction Agent System to ensure new code in development does not bring bugs to the previous system Technology Applications and Expertise Specialized Skills deep learning, machine learning, biomedical signal analysis, analysis of electronic medical records person re-identification Markup/Programming/framework Python, C, PyTorch"}],"posts":[{"title":"权限解锁了吗？","slug":"test-2","date":"2021-05-07T09:58:48.000Z","updated":"2021-05-07T09:58:48.822Z","comments":true,"path":"2021/05/07/test-2/","link":"","permalink":"https://wudi1183456665.github.io/wudi.github.io/2021/05/07/test-2/","excerpt":"","text":"ssa","categories":[],"tags":[]},{"title":"test","slug":"test","date":"2021-05-07T09:00:14.000Z","updated":"2021-05-07T09:00:14.891Z","comments":true,"path":"2021/05/07/test/","link":"","permalink":"https://wudi1183456665.github.io/wudi.github.io/2021/05/07/test/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"post title with whitespace","slug":"post-title-with-whitespace","date":"2021-05-07T08:16:05.000Z","updated":"2021-05-07T08:16:05.983Z","comments":true,"path":"2021/05/07/post-title-with-whitespace/","link":"","permalink":"https://wudi1183456665.github.io/wudi.github.io/2021/05/07/post-title-with-whitespace/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-05-07T06:12:36.330Z","updated":"2021-05-07T12:04:12.983Z","comments":true,"path":"2021/05/07/hello-world/","link":"","permalink":"https://wudi1183456665.github.io/wudi.github.io/2021/05/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"unknown","slug":"unknown","permalink":"https://wudi1183456665.github.io/wudi.github.io/categories/unknown/"}],"tags":[{"name":"test","slug":"test","permalink":"https://wudi1183456665.github.io/wudi.github.io/tags/test/"}]}],"categories":[{"name":"unknown","slug":"unknown","permalink":"https://wudi1183456665.github.io/wudi.github.io/categories/unknown/"}],"tags":[{"name":"test","slug":"test","permalink":"https://wudi1183456665.github.io/wudi.github.io/tags/test/"}]}